In [6]:
import pandas as pd
a=pd.DataFrame({"NAME":["Neeraja","kittu","Haseena","Hema","Keerthi"], "Age":[18,17,19,pd.NaT,20],"City":["Vizag","Tuni",pd.NaT,"Vizag",pd.NaT]})
a

      NAME  Age   City
0  Neeraja   18  Vizag
1    kittu   17   Tuni
2  Haseena   19    NaT
3     Hema  NaT  Vizag
4  Keerthi   20    NaT

In [7]:
a.dropna()

      NAME Age   City
0  Neeraja  18  Vizag
1    kittu  17   Tuni

In [8]:
a.dropna(axis="columns")

      NAME
0  Neeraja
1    kittu
2  Haseena
3     Hema
4  Keerthi

In [9]:
a.dropna(how="all")

      NAME  Age   City
0  Neeraja   18  Vizag
1    kittu   17   Tuni
2  Haseena   19    NaT
3     Hema  NaT  Vizag
4  Keerthi   20    NaT

In [10]:
a.dropna(how="any")

      NAME Age   City
0  Neeraja  18  Vizag
1    kittu  17   Tuni

In [25]:
import pandas as pd
a=pd.DataFrame({"NAME":["Neeraja","kittu","Haseena","Hema","Keerthi"], "Age":[18,17,19,pd.NaT,20],"City":["Vizag","Tuni",pd.NaT,"Vizag",pd.NaT]})
a.dropna(thresh=2)

      NAME  Age   City
0  Neeraja   18  Vizag
1    kittu   17   Tuni
2  Haseena   19    NaT
3     Hema  NaT  Vizag
4  Keerthi   20    NaT

In [17]:
a.dropna(subset=['NAME'])

      NAME  Age   City
0  Neeraja   18  Vizag
1    kittu   17   Tuni
2  Haseena   19    NaT
3     Hema  NaT  Vizag
4  Keerthi   20    NaT

In [18]:
a.dropna(subset=['Age'])

      NAME Age   City
0  Neeraja  18  Vizag
1    kittu  17   Tuni
2  Haseena  19    NaT
4  Keerthi  20    NaT

In [19]:
a.dropna(subset=['City'])

      NAME  Age   City
0  Neeraja   18  Vizag
1    kittu   17   Tuni
3     Hema  NaT  Vizag

In [6]:
import pandas as pd
a=pd.DataFrame({"NAME":["Neeraja","kittu","Haseena","Hema","Keerthi"], "Age":[18,17,19,pd.NaT,20],"City":["Vizag","Tuni",pd.NaT,"Vizag",pd.NaT]})
a.dropna(inplace=True)
a

      NAME Age   City
0  Neeraja  18  Vizag
1    kittu  17   Tuni

In [21]:
a

      NAME Age   City
0  Neeraja  18  Vizag
1    kittu  17   Tuni

In [22]:
a

      NAME Age   City
0  Neeraja  18  Vizag
1    kittu  17   Tuni

In [23]:
c=pd.DataFrame({"NAME":["Neeraja","kittu","Haseena","Hema","Keerthi"], "Age":[18,17,19,pd.NaT,20],"City":["Vizag","Tuni",pd.NaT,"Vizag",pd.NaT]})
c

      NAME  Age   City
0  Neeraja   18  Vizag
1    kittu   17   Tuni
2  Haseena   19    NaT
3     Hema  NaT  Vizag
4  Keerthi   20    NaT

In [25]:
c["Age"].replace(pd.NaT,20)
c

      NAME  Age   City
0  Neeraja   18  Vizag
1    kittu   17   Tuni
2  Haseena   19    NaT
3     Hema  NaT  Vizag
4  Keerthi   20    NaT

In [28]:
c["Age"].replace(pd.NaT,20)

0    18
1    17
2    19
3    20
4    20
Name: Age, dtype: int64

In [29]:
c["City"].replace(pd.NaT,"Srikakulam")

0         Vizag
1          Tuni
2    Srikakulam
3         Vizag
4    Srikakulam
Name: City, dtype: object

In [30]:
import pandas as pd
import numpy as np
pd.cut(np.array([2,7,5,4,6,8]),3)

[(1.994, 4.0], (6.0, 8.0], (4.0, 6.0], (1.994, 4.0], (4.0, 6.0], (6.0, 8.0]]
Categories (3, interval[float64, right]): [(1.994, 4.0] < (4.0, 6.0] < (6.0, 8.0]]

In [32]:
pd.cut(np.array([1,10]),3)

[(0.991, 4.0], (7.0, 10.0]]
Categories (3, interval[float64, right]): [(0.991, 4.0] < (4.0, 7.0] < (7.0, 10.0]]

In [33]:
pd.cut(np.array([2,7,5,4,6,8]),3,retbins=True)

([(1.994, 4.0], (6.0, 8.0], (4.0, 6.0], (1.994, 4.0], (4.0, 6.0], (6.0, 8.0]]
 Categories (3, interval[float64, right]): [(1.994, 4.0] < (4.0, 6.0] < (6.0, 8.0]],
 array([1.994, 4.   , 6.   , 8.   ]))

In [36]:
pd.cut(np.array([2,7,5,4,6,8]),3,labels=["small","big","large"])

['small', 'large', 'big', 'small', 'big', 'large']
Categories (3, object): ['small' < 'big' < 'large']